mike-moseley/dactyl-esp32-c6-fw/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# BLE via NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y

# Disable classic BT (BLE only)
CONFIG_BT_CLASSIC_ENABLED=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
